TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_error_aggregator.h
//###########################################################################
//
// FILE:    hw_error_aggregator.h
//
// TITLE:   Definitions for the ERROR_AGGREGATOR registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_ERROR_AGGREGATOR_H
#define HW_ERROR_AGGREGATOR_H

//*************************************************************************************************
//
// The following are defines for the ERROR_AGGREGATOR register offsets
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_O_HSM_HIGHPRIO_ERROR_ADDRESS   0x0U    // High Priority Error address
                                                                // register
#define ERROR_AGGREGATOR_O_HSM_LOWPRIO_ERROR_ADDRESS    0x4U    // Low Priority Error address
                                                                // register
#define ERROR_AGGREGATOR_O_HSM_ERROR_TYPE               0x8U    // Error Type Register
#define ERROR_AGGREGATOR_O_HSM_ERROR_TYPE_FRC           0xCU    // Error Type Force Register
#define ERROR_AGGREGATOR_O_HSM_ERROR_TYPE_CLR           0x10U   // Error Type Clear Register

#define ERROR_AGGREGATOR_O_CPU1_PR_HIGHPRIO_ERROR_ADDRESS     0x0U     // CPU1 PR Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_PR_LOWPRIO_ERROR_ADDRESS      0x4U     // CPU1 PR Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_PR_ERROR_TYPE                 0x8U     // CPU1 PR Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU1_PR_ERROR_TYPE_FRC             0xCU     // CPU1 PR Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU1_PR_ERROR_TYPE_CLR             0x10U    // CPU1 PR Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU1_PR_PC                         0x14U    // CPU1 PR Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU1_DR1_HIGHPRIO_ERROR_ADDRESS    0x40U    // CPU1 DR1 Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_DR1_LOWPRIO_ERROR_ADDRESS     0x44U    // CPU1 DR1 Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_DR1_ERROR_TYPE                0x48U    // CPU1 DR1 Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU1_DR1_ERROR_TYPE_FRC            0x4CU    // CPU1 DR1 Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU1_DR1_ERROR_TYPE_CLR            0x50U    // CPU1 DR1 Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU1_DR1_PC                        0x54U    // CPU1 DR1 Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU1_DR2_HIGHPRIO_ERROR_ADDRESS    0x80U    // CPU1 DR2 Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_DR2_LOWPRIO_ERROR_ADDRESS     0x84U    // CPU1 DR2 Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_DR2_ERROR_TYPE                0x88U    // CPU1 DR2 Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU1_DR2_ERROR_TYPE_FRC            0x8CU    // CPU1 DR2 Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU1_DR2_ERROR_TYPE_CLR            0x90U    // CPU1 DR2 Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU1_DR2_PC                        0x94U    // CPU1 DR2 Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU1_DW_HIGHPRIO_ERROR_ADDRESS     0xC0U    // CPU1 DW Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_DW_LOWPRIO_ERROR_ADDRESS      0xC4U    // CPU1 DW Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_DW_ERROR_TYPE                 0xC8U    // CPU1 DW Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU1_DW_ERROR_TYPE_FRC             0xCCU    // CPU1 DW Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU1_DW_ERROR_TYPE_CLR             0xD0U    // CPU1 DW Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU1_DW_PC                         0xD4U    // CPU1 DW Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU1_INT_HIGHPRIO_ERROR_ADDRESS    0x100U   // CPU1 INT Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_INT_LOWPRIO_ERROR_ADDRESS     0x104U   // CPU1 INT Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU1_INT_ERROR_TYPE                0x108U   // CPU1 INT Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU1_INT_ERROR_TYPE_FRC            0x10CU   // CPU1 INT Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU1_INT_ERROR_TYPE_CLR            0x110U   // CPU1 INT Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU1_INT_PC                        0x114U   // CPU1 INT Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU2_PR_HIGHPRIO_ERROR_ADDRESS     0x140U   // CPU2 PR Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_PR_LOWPRIO_ERROR_ADDRESS      0x144U   // CPU2 PR Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_PR_ERROR_TYPE                 0x148U   // CPU2 PR Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU2_PR_ERROR_TYPE_FRC             0x14CU   // CPU2 PR Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU2_PR_ERROR_TYPE_CLR             0x150U   // CPU2 PR Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU2_PR_PC                         0x154U   // CPU2 PR Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU2_DR1_HIGHPRIO_ERROR_ADDRESS    0x180U   // CPU2 DR1 Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_DR1_LOWPRIO_ERROR_ADDRESS     0x184U   // CPU2 DR1 Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_DR1_ERROR_TYPE                0x188U   // CPU2 DR1 Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU2_DR1_ERROR_TYPE_FRC            0x18CU   // CPU2 DR1 Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU2_DR1_ERROR_TYPE_CLR            0x190U   // CPU2 DR1 Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU2_DR1_PC                        0x194U   // CPU2 DR1 Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU2_DR2_HIGHPRIO_ERROR_ADDRESS    0x1C0U   // CPU2 DR2 Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_DR2_LOWPRIO_ERROR_ADDRESS     0x1C4U   // CPU2 DR2 Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_DR2_ERROR_TYPE                0x1C8U   // CPU2 DR2 Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU2_DR2_ERROR_TYPE_FRC            0x1CCU   // CPU2 DR2 Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU2_DR2_ERROR_TYPE_CLR            0x1D0U   // CPU2 DR2 Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU2_DR2_PC                        0x1D4U   // CPU2 DR2 Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU2_DW_HIGHPRIO_ERROR_ADDRESS     0x200U   // CPU2 DW Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_DW_LOWPRIO_ERROR_ADDRESS      0x204U   // CPU2 DW Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_DW_ERROR_TYPE                 0x208U   // CPU2 DW Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU2_DW_ERROR_TYPE_FRC             0x20CU   // CPU2 DW Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU2_DW_ERROR_TYPE_CLR             0x210U   // CPU2 DW Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU2_DW_PC                         0x214U   // CPU2 DW Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU2_INT_HIGHPRIO_ERROR_ADDRESS    0x240U   // CPU2 INT Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_INT_LOWPRIO_ERROR_ADDRESS     0x244U   // CPU2 INT Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU2_INT_ERROR_TYPE                0x248U   // CPU2 INT Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU2_INT_ERROR_TYPE_FRC            0x24CU   // CPU2 INT Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU2_INT_ERROR_TYPE_CLR            0x250U   // CPU2 INT Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU2_INT_PC                        0x254U   // CPU2 INT Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU3_PR_HIGHPRIO_ERROR_ADDRESS     0x280U   // CPU3 PR Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_PR_LOWPRIO_ERROR_ADDRESS      0x284U   // CPU3 PR Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_PR_ERROR_TYPE                 0x288U   // CPU3 PR Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU3_PR_ERROR_TYPE_FRC             0x28CU   // CPU3 PR Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU3_PR_ERROR_TYPE_CLR             0x290U   // CPU3 PR Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU3_PR_PC                         0x294U   // CPU3 PR Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU3_DR1_HIGHPRIO_ERROR_ADDRESS    0x2C0U   // CPU3 DR1 Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_DR1_LOWPRIO_ERROR_ADDRESS     0x2C4U   // CPU3 DR1 Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_DR1_ERROR_TYPE                0x2C8U   // CPU3 DR1 Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU3_DR1_ERROR_TYPE_FRC            0x2CCU   // CPU3 DR1 Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU3_DR1_ERROR_TYPE_CLR            0x2D0U   // CPU3 DR1 Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU3_DR1_PC                        0x2D4U   // CPU3 DR1 Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU3_DR2_HIGHPRIO_ERROR_ADDRESS    0x300U   // CPU3 DR2 Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_DR2_LOWPRIO_ERROR_ADDRESS     0x304U   // CPU3 DR2 Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_DR2_ERROR_TYPE                0x308U   // CPU3 DR2 Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU3_DR2_ERROR_TYPE_FRC            0x30CU   // CPU3 DR2 Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU3_DR2_ERROR_TYPE_CLR            0x310U   // CPU3 DR2 Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU3_DR2_PC                        0x314U   // CPU3 DR2 Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU3_DW_HIGHPRIO_ERROR_ADDRESS     0x340U   // CPU3 DW Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_DW_LOWPRIO_ERROR_ADDRESS      0x344U   // CPU3 DW Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_DW_ERROR_TYPE                 0x348U   // CPU3 DW Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU3_DW_ERROR_TYPE_FRC             0x34CU   // CPU3 DW Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU3_DW_ERROR_TYPE_CLR             0x350U   // CPU3 DW Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU3_DW_PC                         0x354U   // CPU3 DW Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_CPU3_INT_HIGHPRIO_ERROR_ADDRESS    0x380U   // CPU3 INT Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_INT_LOWPRIO_ERROR_ADDRESS     0x384U   // CPU3 INT Error aggregator
                                                                       // Low Priority Error address register
#define ERROR_AGGREGATOR_O_CPU3_INT_ERROR_TYPE                0x388U   // CPU3 INT Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_CPU3_INT_ERROR_TYPE_FRC            0x38CU   // CPU3 INT Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_CPU3_INT_ERROR_TYPE_CLR            0x390U   // CPU3 INT Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_CPU3_INT_PC                        0x394U   // CPU3 INT Error aggregator
                                                                       // Register to store PC value at the
                                                                       // first High priority error event
#define ERROR_AGGREGATOR_O_RTDMA1_DR_HIGHPRIO_ERROR_ADDRESS   0x780U   // RTDMA1 DR Error
                                                                       // aggregator High Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA1_DR_LOWPRIO_ERROR_ADDRESS    0x784U   // RTDMA1 DR Error
                                                                       // aggregator Low Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA1_DR_ERROR_TYPE               0x788U   // RTDMA1 DR Error
                                                                       // aggregator Error Type Register
#define ERROR_AGGREGATOR_O_RTDMA1_DR_ERROR_TYPE_FRC           0x78CU   // RTDMA1 DR Error
                                                                       // aggregator Error Type Force Register
#define ERROR_AGGREGATOR_O_RTDMA1_DR_ERROR_TYPE_CLR           0x790U   // RTDMA1 DR Error
