TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_error_aggregator.h
                                                                       // aggregator Error Type Clear Register
#define ERROR_AGGREGATOR_O_RTDMA1_DW_HIGHPRIO_ERROR_ADDRESS   0x7C0U   // RTDMA1 DW Error
                                                                       // aggregator High Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA1_DW_LOWPRIO_ERROR_ADDRESS    0x7C4U   // RTDMA1 DW Error
                                                                       // aggregator Low Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA1_DW_ERROR_TYPE               0x7C8U   // RTDMA1 DW Error
                                                                       // aggregator Error Type Register
#define ERROR_AGGREGATOR_O_RTDMA1_DW_ERROR_TYPE_FRC           0x7CCU   // RTDMA1 DW Error
                                                                       // aggregator Error Type Force Register
#define ERROR_AGGREGATOR_O_RTDMA1_DW_ERROR_TYPE_CLR           0x7D0U   // RTDMA1 DW Error
                                                                       // aggregator Error Type Clear Register
#define ERROR_AGGREGATOR_O_RTDMA2_DR_HIGHPRIO_ERROR_ADDRESS   0x800U   // RTDMA2 DR Error
                                                                       // aggregator High Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA2_DR_LOWPRIO_ERROR_ADDRESS    0x804U   // RTDMA2 DR Error
                                                                       // aggregator Low Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA2_DR_ERROR_TYPE               0x808U   // RTDMA2 DR Error
                                                                       // aggregator Error Type Register
#define ERROR_AGGREGATOR_O_RTDMA2_DR_ERROR_TYPE_FRC           0x80CU   // RTDMA2 DR Error
                                                                       // aggregator Error Type Force Register
#define ERROR_AGGREGATOR_O_RTDMA2_DR_ERROR_TYPE_CLR           0x810U   // RTDMA2 DR Error
                                                                       // aggregator Error Type Clear Register
#define ERROR_AGGREGATOR_O_RTDMA2_DW_HIGHPRIO_ERROR_ADDRESS   0x840U   // RTDMA2 DW Error
                                                                       // aggregator High Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA2_DW_LOWPRIO_ERROR_ADDRESS    0x844U   // RTDMA2 DW Error
                                                                       // aggregator Low Priority Error
                                                                       // address register
#define ERROR_AGGREGATOR_O_RTDMA2_DW_ERROR_TYPE               0x848U   // RTDMA2 DW Error
                                                                       // aggregator Error Type Register
#define ERROR_AGGREGATOR_O_RTDMA2_DW_ERROR_TYPE_FRC           0x84CU   // RTDMA2 DW Error
                                                                       // aggregator Error Type Force Register
#define ERROR_AGGREGATOR_O_RTDMA2_DW_ERROR_TYPE_CLR           0x850U   // RTDMA2 DW Error
                                                                       // aggregator Error Type Clear Register
#define ERROR_AGGREGATOR_O_SSU_HIGHPRIO_ERROR_ADDRESS         0x880U   // SSU Error aggregator High
                                                                       // Priority Error address register
#define ERROR_AGGREGATOR_O_SSU_ERROR_TYPE                     0x888U   // SSU Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_SSU_ERROR_TYPE_FRC                 0x88CU   // SSU Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_SSU_ERROR_TYPE_CLR                 0x890U   // SSU Error aggregator
                                                                       // Error Type Clear Register
#define ERROR_AGGREGATOR_O_ETHERCAT_HIGHPRIO_ERROR_ADDRESS    0x8C0U   // ETHERCAT Error aggregator
                                                                       // High Priority Error address register
#define ERROR_AGGREGATOR_O_ETHERCAT_ERROR_TYPE                0x8C8U   // ETHERCAT Error aggregator
                                                                       // Error Type Register
#define ERROR_AGGREGATOR_O_ETHERCAT_ERROR_TYPE_FRC            0x8CCU   // ETHERCAT Error aggregator
                                                                       // Error Type Force Register
#define ERROR_AGGREGATOR_O_ETHERCAT_ERROR_TYPE_CLR            0x8D0U   // ETHERCAT Error aggregator
                                                                       // Error Type Clear Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the HSM_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_SECURITY_VIO      0x1U          // Security violation
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_ACC_TIMEOUT_ERR   0x10U         // Access timeout error
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_ACC_ACK_ERR       0x20U         // Access ACK error
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_UNCERR            0x40U         // Uncorrectable error
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CERR              0x80U         // Correctable error
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_ACC_TYPE_READ     0x4000U       // Access type Read
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_ACC_TYPE_WRITE    0x8000U       // Access type write
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_LP_SOFTWARE_ERR   0x40000000U   // Low Priority error set
                                                                        // by software
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_HP_SOFTWARE_ERR   0x80000000U   // High Priority error set
                                                                        // by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the HSM_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_SECURITY_VIO      0x1U          // Security violation
                                                                            // force
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR   0x10U         // Access timeout error
                                                                            // force
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_ACC_ACK_ERR       0x20U         // Access ACK error
                                                                            // force
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_UNCERR            0x40U         // Uncorrectable error
                                                                            // force
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_CERR              0x80U         // Correctable error
                                                                            // force
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_ACC_TYPE_READ     0x4000U       // Access type Read
                                                                            // force
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_ACC_TYPE_WRITE    0x8000U       // Access type write
                                                                            // force
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_LP_SOFTWARE_ERR   0x40000000U   // Force low priority
                                                                            // software error
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_FRC_HP_SOFTWARE_ERR   0x80000000U   // Force high priority
                                                                            // software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the HSM_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_SECURITY_VIO      0x1U          // Security violation
                                                                            // clear
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR   0x10U         // Access timeout error
                                                                            // clear
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_ACC_ACK_ERR       0x20U         // Access ACK error
                                                                            // clear
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_UNCERR            0x40U         // Uncorrectable error
                                                                            // clear
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_CERR              0x80U         // Correctable error
                                                                            // clear
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_ACC_TYPE_READ     0x4000U       // Access type Read
                                                                            // clear
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_ACC_TYPE_WRITE    0x8000U       // Access type write
                                                                            // clear
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_LP_SOFTWARE_ERR   0x40000000U   // clear low priority
                                                                            // software error
#define ERROR_AGGREGATOR_HSM_ERROR_TYPE_CLR_HP_SOFTWARE_ERR   0x80000000U   // clear high priority
                                                                            // software error


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_PR_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_INSTR_SECURITY_VIO    0x1U          // Instruction
                                                                                // packet security violation.
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_SEC_ENTRY_VIO         0x2U          // Secure entry and
                                                                                // linear code crossing error.
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_SEC_EXIT_VIO          0x4U          // Secure exit
                                                                                // error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_MAX_PSP_ERR           0x8U          //  MAX PSP error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_ACC_TIMEOUT_ERR       0x10U         // Access timeout
                                                                                // error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_ACC_ACK_ERR           0x20U         // Access ACK error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_UNCERR                0x40U         // Uncorrectable
                                                                                // error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CERR                  0x80U         // Correctable
                                                                                // error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_WARN_PSP_ERR          0x100U        // Warn PSP error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_SW_BREAKPOINT_ERR     0x200U        // Software
                                                                                // brakepoint error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_ILLEGAL_INSTRUCTION   0x400U        // Illegal
                                                                                // instruction error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_INSTRUCTION_TIMEOUT   0x800U        // Instruction
                                                                                // timeout error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_LP_SOFTWARE_ERR       0x40000000U   // Low Priority
                                                                                // error set by software
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_HP_SOFTWARE_ERR       0x80000000U   // high priority
                                                                                // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_PR_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_INSTR_SECURITY_VIO    0x1U          // Instruction
                                                                                    // packet security violation force.
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_SEC_ENTRY_VIO         0x2U          // Secure entry
                                                                                    // and linear code crossing error
                                                                                    // force.
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_SEC_EXIT_VIO          0x4U          // Secure exit
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_MAX_PSP_ERR           0x8U          // MAX PSP
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR       0x10U         // Access
                                                                                    // timeout error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_ACC_ACK_ERR           0x20U         // Access ACK
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_UNCERR                0x40U         //
                                                                                    // Uncorrectable error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_CERR                  0x80U         // Correctable
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_WARN_PSP_ERR          0x100U        // Warn PSP
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_SW_BREAKPOINT_ERR     0x200U        // Software
                                                                                    // brakepoint error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_ILLEGAL_INSTRUCTION   0x400U        // Illegal
                                                                                    // instruction error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_INSTRUCTION_TIMEOUT   0x800U        // Instruction
                                                                                    // timeout error force
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_LP_SOFTWARE_ERR       0x40000000U   // Force low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_FRC_HP_SOFTWARE_ERR       0x80000000U   // Force high
                                                                                    // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_PR_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_INSTR_SECURITY_VIO    0x1U          // Instruction
                                                                                    // packet security violation clear.
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_SEC_ENTRY_VIO         0x2U          // Secure entry
                                                                                    // and linear code crossing error
                                                                                    // clear.
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_SEC_EXIT_VIO          0x4U          // Secure exit
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_MAX_PSP_ERR           0x8U          // MAX PSP
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR       0x10U         // Access
                                                                                    // timeout error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_ACC_ACK_ERR           0x20U         // Access ACK
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_UNCERR                0x40U         //
                                                                                    // Uncorrectable error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_CERR                  0x80U         // Correctable
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_WARN_PSP_ERR          0x100U        // Warn PSP
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_SW_BREAKPOINT_ERR     0x200U        // Software
                                                                                    // brakepoint error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_ILLEGAL_INSTRUCTION   0x400U        // Illegal
                                                                                    // instruction error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_INSTRUCTION_TIMEOUT   0x800U        // Instruction
                                                                                    // timeout error clear
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_LP_SOFTWARE_ERR       0x40000000U   // clear low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU1_PR_ERROR_TYPE_CLR_HP_SOFTWARE_ERR       0x80000000U   // clear high
                                                                                    // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_DR1_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_SECURITY_VIO         0x1U          // Security
                                                                                // violation
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_ACC_TIMEOUT_ERR      0x10U         // Access timeout
                                                                                // error
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_ACC_ACK_ERR          0x20U         // Access ACK error
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_UNCERR               0x40U         // Uncorrectable
                                                                                // error
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_CERR                 0x80U         // Correctable
                                                                                // error
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                // address error
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_LP_SOFTWARE_ERR      0x40000000U   // Low Priority
                                                                                // error set by software
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_HP_SOFTWARE_ERR      0x80000000U   // high priority
                                                                                // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU1_DR1_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_SECURITY_VIO         0x1U          // Security
                                                                                    // violation force
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR      0x10U         // Access
                                                                                    // timeout error force
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_ACC_ACK_ERR          0x20U         // Access ACK
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_UNCERR               0x40U         //
                                                                                    // Uncorrectable error force
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_CERR                 0x80U         // Correctable
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                    // address error force
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_LP_SOFTWARE_ERR      0x40000000U   // Force low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU1_DR1_ERROR_TYPE_FRC_HP_SOFTWARE_ERR      0x80000000U   // force high
                                                                                    // priority software error

