TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_error_aggregator.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_PR_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_INSTR_SECURITY_VIO    0x1U          // Instruction
                                                                                    // packet security violation clear.
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_SEC_ENTRY_VIO         0x2U          // Secure entry
                                                                                    // and linear code crossing error
                                                                                    // clear.
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_SEC_EXIT_VIO          0x4U          // Secure exit
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_MAX_PSP_ERR           0x8U          // MAX PSP
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR       0x10U         // Access
                                                                                    // timeout error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_ACC_ACK_ERR           0x20U         // Access ACK
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_UNCERR                0x40U         //
                                                                                    // Uncorrectable error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_CERR                  0x80U         // Correctable
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_WARN_PSP_ERR          0x100U        // Warn PSP
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_SW_BREAKPOINT_ERR     0x200U        // Software
                                                                                    // brakepoint error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_ILLEGAL_INSTRUCTION   0x400U        // Illegal
                                                                                    // instruction error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_INSTRUCTION_TIMEOUT   0x800U        // Instruction
                                                                                    // timeout error clear
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_LP_SOFTWARE_ERR       0x40000000U   // clear low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU2_PR_ERROR_TYPE_CLR_HP_SOFTWARE_ERR       0x80000000U   // clear high
                                                                                    // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DR1_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_SECURITY_VIO         0x1U          // Security
                                                                                // violation
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_ACC_TIMEOUT_ERR      0x10U         // Access timeout
                                                                                // error
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_ACC_ACK_ERR          0x20U         // Access ACK error
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_UNCERR               0x40U         // Uncorrectable
                                                                                // error
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CERR                 0x80U         // Correctable
                                                                                // error
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                // address error
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_LP_SOFTWARE_ERR      0x40000000U   // Low Priority
                                                                                // error set by software
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_HP_SOFTWARE_ERR      0x80000000U   // high priority
                                                                                // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DR1_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_SECURITY_VIO         0x1U          // Security
                                                                                    // violation force
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR      0x10U         // Access
                                                                                    // timeout error force
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_ACC_ACK_ERR          0x20U         // Access ACK
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_UNCERR               0x40U         //
                                                                                    // Uncorrectable error force
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_CERR                 0x80U         // Correctable
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                    // address error force
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_LP_SOFTWARE_ERR      0x40000000U   // Force low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_FRC_HP_SOFTWARE_ERR      0x80000000U   // force high
                                                                                    // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DR1_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_SECURITY_VIO         0x1U          // Security
                                                                                    // violation clear
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR      0x10U         // Access
                                                                                    // timeout error clear
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_ACC_ACK_ERR          0x20U         // Access ACK
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_UNCERR               0x40U         //
                                                                                    // Uncorrectable error clear
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_CERR                 0x80U         // Correctable
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                    // address error clear
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_LP_SOFTWARE_ERR      0x40000000U   // clear low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU2_DR1_ERROR_TYPE_CLR_HP_SOFTWARE_ERR      0x80000000U   // clear high
                                                                                    // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DR2_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_SECURITY_VIO         0x1U          // Security
                                                                                // violation
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_ACC_TIMEOUT_ERR      0x10U         // Access timeout
                                                                                // error
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_ACC_ACK_ERR          0x20U         // Access ACK error
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_UNCERR               0x40U         // Uncorrectable
                                                                                // error
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CERR                 0x80U         // Correctable
                                                                                // error
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                // address error
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_LP_SOFTWARE_ERR      0x40000000U   // Low Priority
                                                                                // error set by software
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_HP_SOFTWARE_ERR      0x80000000U   // high priority
                                                                                // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DR2_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_SECURITY_VIO         0x1U          // Security
                                                                                    // violation force
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR      0x10U         // Access
                                                                                    // timeout error force
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_ACC_ACK_ERR          0x20U         // Access ACK
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_UNCERR               0x40U         //
                                                                                    // Uncorrectable error force
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_CERR                 0x80U         // Correctable
                                                                                    // error force
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                    // address error force
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_LP_SOFTWARE_ERR      0x40000000U   // Force low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_FRC_HP_SOFTWARE_ERR      0x80000000U   // force high
                                                                                    // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DR2_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_SECURITY_VIO         0x1U          // Security
                                                                                    // violation clear
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR      0x10U         // Access
                                                                                    // timeout error clear
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_ACC_ACK_ERR          0x20U         // Access ACK
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_UNCERR               0x40U         //
                                                                                    // Uncorrectable error clear
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_CERR                 0x80U         // Correctable
                                                                                    // error clear
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                    // address error clear
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_LP_SOFTWARE_ERR      0x40000000U   // clear low
                                                                                    // priority software error
#define ERROR_AGGREGATOR_CPU2_DR2_ERROR_TYPE_CLR_HP_SOFTWARE_ERR      0x80000000U   // clear high
                                                                                    // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DW_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_SECURITY_VIO         0x1U          // Security
                                                                               // violation
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_ACC_TIMEOUT_ERR      0x10U         // Access timeout
                                                                               // error
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_ACC_ACK_ERR          0x20U         // Access ACK error
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_UNCERR               0x40U         // Uncorrectable
                                                                               // error
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CERR                 0x80U         // Correctable error
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_UNALIGNED_ADDR_ERR   0x100U        // Unaligned address
                                                                               // error
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_LP_SOFTWARE_ERR      0x40000000U   // Low Priority
                                                                               // error set by software
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_HP_SOFTWARE_ERR      0x80000000U   // high priority
                                                                               // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DW_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_SECURITY_VIO         0x1U          // Security
                                                                                   // violation force
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR      0x10U         // Access
                                                                                   // timeout error force
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_ACC_ACK_ERR          0x20U         // Access ACK
                                                                                   // error force
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_UNCERR               0x40U         // Uncorrectable
                                                                                   // error force
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_CERR                 0x80U         // Correctable
                                                                                   // error force
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                   // address error force
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_LP_SOFTWARE_ERR      0x40000000U   // Force low
                                                                                   // priority software error
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_FRC_HP_SOFTWARE_ERR      0x80000000U   // force high
                                                                                   // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_DW_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_SECURITY_VIO         0x1U          // Security
                                                                                   // violation clear
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR      0x10U         // Access
                                                                                   // timeout error clear
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_ACC_ACK_ERR          0x20U         // Access ACK
                                                                                   // error clear
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_UNCERR               0x40U         // Uncorrectable
                                                                                   // error clear
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_CERR                 0x80U         // Correctable
                                                                                   // error clear
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_UNALIGNED_ADDR_ERR   0x100U        // Unaligned
                                                                                   // address error clear
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_LP_SOFTWARE_ERR      0x40000000U   // clear low
                                                                                   // priority software error
#define ERROR_AGGREGATOR_CPU2_DW_ERROR_TYPE_CLR_HP_SOFTWARE_ERR      0x80000000U   // clear high
                                                                                   // priority software error

