TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_error_aggregator.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_INT_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_MAIN_ISR_ENTRY_ERR                  0x1U          //
                                                                                               // Main ISR entry error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_MAIN_VECT_CERR                      0x2U          //
                                                                                               // Main Correctable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_MAIN_VECT_UNCERR                    0x4U          //
                                                                                               // Main Uncorrectable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_MAIN_INTERRUPT_RETURN_ERR           0x8U          //
                                                                                               // Main Interrupt return error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_INT_ISR_ENTRY_ERR                   0x10U         //
                                                                                               // INT ISR entry error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_INT_VECT_CERR                       0x20U         //
                                                                                               // INT Correctable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_INT_VECT_UNCERR                     0x40U         //
                                                                                               // INT Uncorrectable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_INT_INTERRUPT_RETURN_ERR            0x80U         //
                                                                                               // INT INTerrupt return error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_RTINT_ISR_ENTRY_ERR                 0x100U        //
                                                                                               // RTINT ISR entry error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_RTINT_VECT_CERR                     0x200U        //
                                                                                               // RTINT Correctable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_RTINT_VECT_UNCERR                   0x400U        //
                                                                                               // RTINT Uncorrectable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_RTINT_INTERRUPT_RETURN_ERR          0x800U        //
                                                                                               // RTINT Interrupt return error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_RTINT_CONTEXT_RESTORE_VECT_CERR     0x1000U       //
                                                                                               // RTINT Context restore Correctable
                                                                                               // vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_RTINT_CONTEXT_RESTORE_VECT_UNCERR   0x2000U       //
                                                                                               // RTINT Context restore Uncorrectable
                                                                                               // vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_NMI_MAXISP_ERR                      0x8000U       //
                                                                                               // NMI MAXISP error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_NMI_ISR_ENTRY_ERR                   0x10000U      //
                                                                                               // NMI ISR entry error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_NMI_VECT_CERR                       0x20000U      //
                                                                                               // NMI Correctable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_NMI_VECT_UNCERR                     0x40000U      //
                                                                                               // NMI Uncorrectable vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_NMI_INTERRUPT_RETURN_ERR            0x80000U      //
                                                                                               // NMI Interrupt return error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_NMI_CONTEXT_RESTORE_VECT_CERR       0x100000U     //
                                                                                               // NMI Context restore Correctable
                                                                                               // vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_NMI_CONTEXT_RESTORE_VECT_UNCERR     0x200000U     //
                                                                                               // NMI Context restore Uncorrectable
                                                                                               // vector error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_VECT_CERR                           0x400000U     //
                                                                                               // Vector Correctable error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_VECT_UNCERR                         0x800000U     //
                                                                                               // Vector Uncorrectable error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_WARNISP                             0x1000000U    //
                                                                                               // warnisp
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_MAXISP                              0x2000000U    //
                                                                                               // maxisp
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_PIPE_SECURITY_VIO                   0x4000000U    //
                                                                                               // PIPE security violation
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_REG_PARITY_ERR                      0x8000000U    //
                                                                                               // PIPE Reg parity error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_REG_PARITY_DIAG_ERR                 0x10000000U   //
                                                                                               // PIPE Register parity diag error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_PIPE_LOCK_KEY_ERR                   0x20000000U   //
                                                                                               // PIPE Lock/key error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_LP_SOFTWARE_ERR                     0x40000000U   //
                                                                                               // Low Priority error set by software
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_HP_SOFTWARE_ERR                     0x80000000U   //
                                                                                               // high priority error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU2_INT_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_MAIN_ISR_ENTRY_ERR                  0x1U          //
                                                                                                   // Main ISR entry error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_MAIN_VECT_CERR                      0x2U          //
                                                                                                   // Main Correctable vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_MAIN_VECT_UNCERR                    0x4U          //
                                                                                                   // Main Uncorrectable vector error
                                                                                                   // force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_MAIN_INTERRUPT_RETURN_ERR           0x8U          //
                                                                                                   // Main Interrupt return error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_INT_ISR_ENTRY_ERR                   0x10U         //
                                                                                                   // INT ISR entry error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_INT_VECT_CERR                       0x20U         //
                                                                                                   // INT Correctable vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_INT_VECT_UNCERR                     0x40U         //
                                                                                                   // INT Uncorrectable vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_INT_INTERRUPT_RETURN_ERR            0x80U         //
                                                                                                   // INT INTerrupt return error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_RTINT_ISR_ENTRY_ERR                 0x100U        //
                                                                                                   // RTINT ISR entry error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_RTINT_VECT_CERR                     0x200U        //
                                                                                                   // RTINT Correctable vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_RTINT_VECT_UNCERR                   0x400U        //
                                                                                                   // RTINT Uncorrectable vector error
                                                                                                   // force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_RTINT_INTERRUPT_RETURN_ERR          0x800U        //
                                                                                                   // RTINT Interrupt return error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_RTINT_CONTEXT_RESTORE_VECT_CERR     0x1000U       //
                                                                                                   // RTINT Context restore Correctable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_RTINT_CONTEXT_RESTORE_VECT_UNCERR   0x2000U       //
                                                                                                   // RTINT Context restore Uncorrectable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_NMI_MAXISP_ERR                      0x8000U       //
                                                                                                   // NMI MAXISP error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_NMI_ISR_ENTRY_ERR                   0x10000U      //
                                                                                                   // NMI ISR entry error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_NMI_VECT_CERR                       0x20000U      //
                                                                                                   // NMI Correctable vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_NMI_VECT_UNCERR                     0x40000U      //
                                                                                                   // NMI Uncorrectable vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_NMI_INTERRUPT_RETURN_ERR            0x80000U      //
                                                                                                   // NMI Interrupt return error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_NMI_CONTEXT_RESTORE_VECT_CERR       0x100000U     //
                                                                                                   // NMI Context restore Correctable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_NMI_CONTEXT_RESTORE_VECT_UNCERR     0x200000U     //
                                                                                                   // NMI Context restore Uncorrectable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_VECT_CERR                           0x400000U     //
                                                                                                   // Vector Correctable error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_VECT_UNCERR                         0x800000U     //
                                                                                                   // Vector Uncorrectable error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_WARNISP                             0x1000000U    //
                                                                                                   // warnisp force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_MAXISP                              0x2000000U    //
                                                                                                   // maxisp force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_PIPE_SECURITY_VIO                   0x4000000U    //
                                                                                                   // PIPE security violation force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_REG_PARITY_ERR                      0x8000000U    //
                                                                                                   // PIPE Reg parity error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_REG_PARITY_DIAG_ERR                 0x10000000U   //
                                                                                                   // PIPE Register parity diag error
                                                                                                   // force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_PIPE_LOCK_KEY_ERR                   0x20000000U   //
                                                                                                   // PIPE Lock key error force
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_LP_SOFTWARE_ERR                     0x40000000U   //
                                                                                                   // Force low priority software error
#define ERROR_AGGREGATOR_CPU2_INT_ERROR_TYPE_FRC_HP_SOFTWARE_ERR                     0x80000000U   //
                                                                                                   // force high priority software error

