TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_error_aggregator.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3_INT_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_MAIN_ISR_ENTRY_ERR                  0x1U          //
                                                                                                   // Main ISR entry error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_MAIN_VECT_CERR                      0x2U          //
                                                                                                   // Main Correctable vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_MAIN_VECT_UNCERR                    0x4U          //
                                                                                                   // Main Uncorrectable vector error
                                                                                                   // force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_MAIN_INTERRUPT_RETURN_ERR           0x8U          //
                                                                                                   // Main Interrupt return error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_INT_ISR_ENTRY_ERR                   0x10U         //
                                                                                                   // INT ISR entry error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_INT_VECT_CERR                       0x20U         //
                                                                                                   // INT Correctable vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_INT_VECT_UNCERR                     0x40U         //
                                                                                                   // INT Uncorrectable vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_INT_INTERRUPT_RETURN_ERR            0x80U         //
                                                                                                   // INT INTerrupt return error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_RTINT_ISR_ENTRY_ERR                 0x100U        //
                                                                                                   // RTINT ISR entry error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_RTINT_VECT_CERR                     0x200U        //
                                                                                                   // RTINT Correctable vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_RTINT_VECT_UNCERR                   0x400U        //
                                                                                                   // RTINT Uncorrectable vector error
                                                                                                   // force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_RTINT_INTERRUPT_RETURN_ERR          0x800U        //
                                                                                                   // RTINT Interrupt return error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_RTINT_CONTEXT_RESTORE_VECT_CERR     0x1000U       //
                                                                                                   // RTINT Context restore Correctable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_RTINT_CONTEXT_RESTORE_VECT_UNCERR   0x2000U       //
                                                                                                   // RTINT Context restore Uncorrectable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_NMI_MAXISP_ERR                      0x8000U       //
                                                                                                   // NMI MAXISP error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_NMI_ISR_ENTRY_ERR                   0x10000U      //
                                                                                                   // NMI ISR entry error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_NMI_VECT_CERR                       0x20000U      //
                                                                                                   // NMI Correctable vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_NMI_VECT_UNCERR                     0x40000U      //
                                                                                                   // NMI Uncorrectable vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_NMI_INTERRUPT_RETURN_ERR            0x80000U      //
                                                                                                   // NMI Interrupt return error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_NMI_CONTEXT_RESTORE_VECT_CERR       0x100000U     //
                                                                                                   // NMI Context restore Correctable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_NMI_CONTEXT_RESTORE_VECT_UNCERR     0x200000U     //
                                                                                                   // NMI Context restore Uncorrectable
                                                                                                   // vector error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_VECT_CERR                           0x400000U     //
                                                                                                   // Vector Correctable error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_VECT_UNCERR                         0x800000U     //
                                                                                                   // Vector Uncorrectable error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_WARNISP                             0x1000000U    //
                                                                                                   // warnisp force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_MAXISP                              0x2000000U    //
                                                                                                   // maxisp force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_PIPE_SECURITY_VIO                   0x4000000U    //
                                                                                                   // PIPE security violation force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_REG_PARITY_ERR                      0x8000000U    //
                                                                                                   // PIPE Reg parity error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_REG_PARITY_DIAG_ERR                 0x10000000U   //
                                                                                                   // PIPE Register parity diag error
                                                                                                   // force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_PIPE_LOCK_KEY_ERR                   0x20000000U   //
                                                                                                   // PIPE Lock key error force
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_LP_SOFTWARE_ERR                     0x40000000U   //
                                                                                                   // Force low priority software error
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_FRC_HP_SOFTWARE_ERR                     0x80000000U   //
                                                                                                   // force high priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPU3_INT_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_MAIN_ISR_ENTRY_ERR                  0x1U          //
                                                                                                   // Main ISR entry error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_MAIN_VECT_CERR                      0x2U          //
                                                                                                   // Main Correctable vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_MAIN_VECT_UNCERR                    0x4U          //
                                                                                                   // Main Uncorrectable vector error
                                                                                                   // clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_MAIN_INTERRUPT_RETURN_ERR           0x8U          //
                                                                                                   // Main Interrupt return error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_INT_ISR_ENTRY_ERR                   0x10U         //
                                                                                                   // INT ISR entry error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_INT_VECT_CERR                       0x20U         //
                                                                                                   // INT Correctable vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_INT_VECT_UNCERR                     0x40U         //
                                                                                                   // INT Uncorrectable vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_INT_INTERRUPT_RETURN_ERR            0x80U         //
                                                                                                   // INT INTerrupt return error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_RTINT_ISR_ENTRY_ERR                 0x100U        //
                                                                                                   // RTINT ISR entry error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_RTINT_VECT_CERR                     0x200U        //
                                                                                                   // RTINT Correctable vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_RTINT_VECT_UNCERR                   0x400U        //
                                                                                                   // RTINT Uncorrectable vector error
                                                                                                   // clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_RTINT_INTERRUPT_RETURN_ERR          0x800U        //
                                                                                                   // RTINT Interrupt return error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_RTINT_CONTEXT_RESTORE_VECT_CERR     0x1000U       //
                                                                                                   // RTINT Context restore Correctable
                                                                                                   // vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_RTINT_CONTEXT_RESTORE_VECT_UNCERR   0x2000U       //
                                                                                                   // RTINT Context restore Uncorrectable
                                                                                                   // vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_NMI_MAXISP_ERR                      0x8000U       //
                                                                                                   // NMI MAXISP error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_NMI_ISR_ENTRY_ERR                   0x10000U      //
                                                                                                   // NMI ISR entry error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_NMI_VECT_CERR                       0x20000U      //
                                                                                                   // NMI Correctable vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_NMI_VECT_UNCERR                     0x40000U      //
                                                                                                   // NMI Uncorrectable vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_NMI_INTERRUPT_RETURN_ERR            0x80000U      //
                                                                                                   // NMI Interrupt return error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_NMI_CONTEXT_RESTORE_VECT_CERR       0x100000U     //
                                                                                                   // NMI Context restore Correctable
                                                                                                   // vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_NMI_CONTEXT_RESTORE_VECT_UNCERR     0x200000U     //
                                                                                                   // NMI Context restore Uncorrectable
                                                                                                   // vector error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_VECT_CERR                           0x400000U     //
                                                                                                   // Vector Correctable error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_VECT_UNCERR                         0x800000U     //
                                                                                                   // Vector Uncorrectable error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_WARNISP                             0x1000000U    //
                                                                                                   // warnisp clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_MAXISP                              0x2000000U    //
                                                                                                   // maxisp clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_PIPE_SECURITY_VIO                   0x4000000U    //
                                                                                                   // PIPE security violation clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_REG_PARITY_ERR                      0x8000000U    //
                                                                                                   // PIPE Reg parity error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_REG_PARITY_DIAG_ERR                 0x10000000U   //
                                                                                                   // PIPE Register parity diag error
                                                                                                   // clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_PIPE_LOCK_KEY_ERR                   0x20000000U   //
                                                                                                   // PIPE Lock key error clear
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_LP_SOFTWARE_ERR                     0x40000000U   //
                                                                                                   // clear low priority software error
#define ERROR_AGGREGATOR_CPU3_INT_ERROR_TYPE_CLR_HP_SOFTWARE_ERR                     0x80000000U   //
                                                                                                   // clear high priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA1_DR_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_SECURITY_VIO      0x1U          // Security violation
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_ACC_ACK_ERR       0x20U         // Access ACK error
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_UNCERR            0x40U         // Uncorrectable
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CERR              0x80U         // Correctable error
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_LP_SOFTWARE_ERR   0x40000000U   // Low priority
                                                                              // software error
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_HP_SOFTWARE_ERR   0x80000000U   // high priority
                                                                              // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA1_DR_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_FRC_SECURITY_VIO      0x1U          // Security
                                                                                  // violation force
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_FRC_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_FRC_UNCERR            0x40U         // Uncorrectable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_FRC_CERR              0x80U         // Correctable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_FRC_LP_SOFTWARE_ERR   0x40000000U   // Force low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_FRC_HP_SOFTWARE_ERR   0x80000000U   // force high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA1_DR_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CLR_SECURITY_VIO      0x1U          // Security
                                                                                  // violation clear
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CLR_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CLR_UNCERR            0x40U         // Uncorrectable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CLR_CERR              0x80U         // Correctable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CLR_LP_SOFTWARE_ERR   0x40000000U   // clear low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA1_DR_ERROR_TYPE_CLR_HP_SOFTWARE_ERR   0x80000000U   // clear high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA1_DW_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_SECURITY_VIO      0x1U          // Security violation
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_ACC_ACK_ERR       0x20U         // Access ACK error
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_UNCERR            0x40U         // Uncorrectable
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CERR              0x80U         // Correctable error
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_LP_SOFTWARE_ERR   0x40000000U   // Low Priority error
                                                                              // set by software
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_HP_SOFTWARE_ERR   0x80000000U   // high priority
                                                                              // error set by software

