TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_error_aggregator.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA1_DW_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_FRC_SECURITY_VIO      0x1U          // Security
                                                                                  // violation force
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_FRC_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_FRC_UNCERR            0x40U         // Uncorrectable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_FRC_CERR              0x80U         // Correctable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_FRC_LP_SOFTWARE_ERR   0x40000000U   // Force low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_FRC_HP_SOFTWARE_ERR   0x80000000U   // force high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA1_DW_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CLR_SECURITY_VIO      0x1U          // Security
                                                                                  // violation clear
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CLR_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CLR_UNCERR            0x40U         // Uncorrectable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CLR_CERR              0x80U         // Correctable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CLR_LP_SOFTWARE_ERR   0x40000000U   // clear low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA1_DW_ERROR_TYPE_CLR_HP_SOFTWARE_ERR   0x80000000U   // clear high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA2_DR_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_SECURITY_VIO      0x1U          // Security violation
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_ACC_ACK_ERR       0x20U         // Access ACK error
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_UNCERR            0x40U         // Uncorrectable
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CERR              0x80U         // Correctable error
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_LP_SOFTWARE_ERR   0x40000000U   // Low priority
                                                                              // software error
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_HP_SOFTWARE_ERR   0x80000000U   // high priority
                                                                              // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA2_DR_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_FRC_SECURITY_VIO      0x1U          // Security
                                                                                  // violation force
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_FRC_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_FRC_UNCERR            0x40U         // Uncorrectable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_FRC_CERR              0x80U         // Correctable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_FRC_LP_SOFTWARE_ERR   0x40000000U   // Force low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_FRC_HP_SOFTWARE_ERR   0x80000000U   // force high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA2_DR_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CLR_SECURITY_VIO      0x1U          // Security
                                                                                  // violation clear
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CLR_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CLR_UNCERR            0x40U         // Uncorrectable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CLR_CERR              0x80U         // Correctable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CLR_LP_SOFTWARE_ERR   0x40000000U   // clear low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA2_DR_ERROR_TYPE_CLR_HP_SOFTWARE_ERR   0x80000000U   // clear high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA2_DW_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_SECURITY_VIO      0x1U          // Security violation
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_ACC_ACK_ERR       0x20U         // Access ACK error
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_UNCERR            0x40U         // Uncorrectable
                                                                              // error
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CERR              0x80U         // Correctable error
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_LP_SOFTWARE_ERR   0x40000000U   // Low Priority error
                                                                              // set by software
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_HP_SOFTWARE_ERR   0x80000000U   // high priority
                                                                              // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA2_DW_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_FRC_SECURITY_VIO      0x1U          // Security
                                                                                  // violation force
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_FRC_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_FRC_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_FRC_UNCERR            0x40U         // Uncorrectable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_FRC_CERR              0x80U         // Correctable
                                                                                  // error force
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_FRC_LP_SOFTWARE_ERR   0x40000000U   // Force low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_FRC_HP_SOFTWARE_ERR   0x80000000U   // force high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA2_DW_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CLR_SECURITY_VIO      0x1U          // Security
                                                                                  // violation clear
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CLR_ACC_TIMEOUT_ERR   0x10U         // Access timeout
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CLR_ACC_ACK_ERR       0x20U         // Access ACK
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CLR_UNCERR            0x40U         // Uncorrectable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CLR_CERR              0x80U         // Correctable
                                                                                  // error clear
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CLR_LP_SOFTWARE_ERR   0x40000000U   // clear low
                                                                                  // priority software error
#define ERROR_AGGREGATOR_RTDMA2_DW_ERROR_TYPE_CLR_HP_SOFTWARE_ERR   0x80000000U   // clear high
                                                                                  // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSU_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CPU1_SSU_MMR_ACCESS_ERROR   0x2U          //
                                                                                  // CPU1_SSU_MMR_ACCESS_ERROR
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CPU2_SSU_MMR_ACCESS_ERROR   0x4U          //
                                                                                  // CPU2_SSU_MMR_ACCESS_ERROR
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CPU3_SSU_MMR_ACCESS_ERROR   0x8U          //
                                                                                  // CPU3_SSU_MMR_ACCESS_ERROR
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_MODE_INVALID                0x80U         // BANKMAP,
                                                                                  // SECVALID, BANKMODE, SSUMODE invalid
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC1_ERROR_STS              0x100U        // FLC1_ERROR_STS
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC1_ERROR_TYPE_S           9U
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC1_ERROR_TYPE_M           0xE00U        //
                                                                                  // FLC1_ERROR_TYPE
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC1_MMR_ACCESS_ERROR       0x1000U       //
                                                                                  // FLC1_MMR_ACCESS_ERROR
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC2_ERROR_STS              0x2000U       // FLC2_
                                                                                  // ERROR_STS
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC2_ERROR_TYPE_S           14U
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC2_ERROR_TYPE_M           0x1C000U      //
                                                                                  // FLC2_ERROR_TYPE
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FLC2_MMR_ACCESS_ERROR       0x20000U      //
                                                                                  // FLC2_MMR_ACCESS_ERROR
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_HP_SOFTWARE_ERR             0x80000000U   // high priority
                                                                                  // error set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSU_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_CPU1_SSU_MMR_ACCESS_ERROR   0x2U          //
                                                                                      // CPU1_SSU_MMR_ACCESS_ERROR force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_CPU2_SSU_MMR_ACCESS_ERROR   0x4U          //
                                                                                      // CPU2_SSU_MMR_ACCESS_ERROR force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_CPU3_SSU_MMR_ACCESS_ERROR   0x8U          //
                                                                                      // CPU3_SSU_MMR_ACCESS_ERROR force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_MODE_INVALID                0x80U         // BANKMAP,
                                                                                      // SECVALID, BANKMODE, SSUMODE invalid 
                                                                                      // force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC1_ERROR_STS              0x100U        //
                                                                                      // FLC1_ERROR_STS  force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC1_ERROR_TYPE_S           9U
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC1_ERROR_TYPE_M           0xE00U        //
                                                                                      // FLC1_ERROR_TYPE force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC1_MMR_ACCESS_ERROR       0x1000U       //
                                                                                      // FLC1_MMR_ACCESS_ERROR force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC2_ERROR_STS              0x2000U       // FLC2_
                                                                                      // ERROR_STS force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC2_ERROR_TYPE_S           14U
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC2_ERROR_TYPE_M           0x1C000U      //
                                                                                      // FLC2_ERROR_TYPE force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_FLC2_MMR_ACCESS_ERROR       0x20000U      //
                                                                                      // FLC2_MMR_ACCESS_ERROR force
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_FRC_HP_SOFTWARE_ERR             0x80000000U   // force high
                                                                                      // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the SSU_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_CPU1_SSU_MMR_ACCESS_ERROR   0x2U          //
                                                                                      // CPU1_SSU_MMR_ACCESS_ERROR Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_CPU2_SSU_MMR_ACCESS_ERROR   0x4U          //
                                                                                      // CPU2_SSU_MMR_ACCESS_ERROR Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_CPU3_SSU_MMR_ACCESS_ERROR   0x8U          //
                                                                                      // CPU3_SSU_MMR_ACCESS_ERROR Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_MODE_INVALID                0x80U         // BANKMAP,
                                                                                      // SECVALID, BANKMODE, SSUMODE invalid 
                                                                                      // Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC1_ERROR_STS              0x100U        //
                                                                                      // FLC1_ERROR_STS  Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC1_ERROR_TYPE_S           9U
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC1_ERROR_TYPE_M           0xE00U        //
                                                                                      // FLC1_ERROR_TYPE Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC1_MMR_ACCESS_ERROR       0x1000U       //
                                                                                      // FLC1_MMR_ACCESS_ERROR Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC2_ERROR_STS              0x2000U       // FLC2_
                                                                                      // ERROR_STS Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC2_ERROR_TYPE_S           14U
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC2_ERROR_TYPE_M           0x1C000U      //
                                                                                      // FLC2_ERROR_TYPE Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_FLC2_MMR_ACCESS_ERROR       0x20000U      //
                                                                                      // FLC2_MMR_ACCESS_ERROR Clear
#define ERROR_AGGREGATOR_SSU_ERROR_TYPE_CLR_HP_SOFTWARE_ERR             0x80000000U   // clear high
                                                                                      // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCAT_ERROR_TYPE register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_ETHERCAT_ERROR_TYPE_UNCERR            0x40U         // Uncorrectable error
#define ERROR_AGGREGATOR_ETHERCAT_ERROR_TYPE_HP_SOFTWARE_ERR   0x80000000U   // high priority error
                                                                             // set by software

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCAT_ERROR_TYPE_FRC register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_ETHERCAT_ERROR_TYPE_FRC_UNCERR            0x40U         // Uncorrectable
                                                                                 // error force
#define ERROR_AGGREGATOR_ETHERCAT_ERROR_TYPE_FRC_HP_SOFTWARE_ERR   0x80000000U   // force high
                                                                                 // priority software error

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCAT_ERROR_TYPE_CLR register
//
//*************************************************************************************************
#define ERROR_AGGREGATOR_ETHERCAT_ERROR_TYPE_CLR_UNCERR            0x40U         // Uncorrectable
                                                                                 // error clear
#define ERROR_AGGREGATOR_ETHERCAT_ERROR_TYPE_CLR_HP_SOFTWARE_ERR   0x80000000U   // clear high
                                                                                 // priority software error



#endif
